:PROPERTIES:
:ID:       8fa11927-e786-40ca-843a-5eceeff7ad08
:END:
#+title: Sierpinski Triangle

#+begin_src python :results output :python "python3.8"
import sys
import stddraw
import stdrandom
import math

trials = 100

c = math.sqrt(3.) / 2.
cx = [0., 1., .5]
cy = [0., 0., c]

stddraw.setPenRadius(.01)
x = 0.
y = 0.

for t in range(0, trials):
        r = int(stdrandom.uniform() * 3)
        x = (x + cx[r]) / 2.0
        y = (y + cy[r]) / 2.0
        stddraw.point(x, y)
        stddraw.show()
#+end_src

#+RESULTS:
: pygame 2.5.2 (SDL 2.28.3, Python 3.8.18)
: Hello from the pygame community. https://www.pygame.org/contribute.html
